In [78]:
import pandas as ps

In [79]:
data = ps.read_excel(r'D:\Data Employee.xlsx')
data

    EmpId Name   Age   Salary Address  Gender
0       1    A  21.0   5000.0      KL       M
1       2    S  22.0   6000.0      RJ       M
2       3    D  23.0   7000.0     NaN       F
3       4    F  24.0   8000.0     NaN       F
4       5    G  25.0   9000.0     NaN    Male
5       6    h  26.0      NaN     NaN    Male
6       7    K  27.0  11000.0     NaN       M
7       8    K  28.0  12000.0     NaN  Female
8       9    L   NaN  13000.0      RJ       M
9      10    Q  30.0  14000.0     NaN  Female
10     11    w  31.0      NaN     NaN       F
11     12    E  32.0  16000.0     NaN       M
12     13    R  33.0  17000.0      KA    Male
13     14  NaN  34.0      NaN     NaN  Female
14     15    Y  35.0  19000.0     NaN       M
15     16    U  36.0  20000.0     NaN    Male
16     17    i  37.0  21000.0     NaN  Female
17     18    O  38.0  22000.0     NaN    Male
18     18    o  38.0  22000.0     NaN       M
19     15    Y  35.0  19000.0     NaN       M

In [46]:
data = data.set_index('Name')
data

      EmpId   Age   Salary Address  Gender
Name
A         1  21.0   5000.0      KL       M
S         2  22.0   6000.0      RJ       M
D         3  23.0   7000.0     NaN       F
F         4  24.0   8000.0     NaN       F
G         5  25.0   9000.0     NaN    Male
h         6  26.0      NaN     NaN    Male
K         7  27.0  11000.0     NaN       M
K         8  28.0  12000.0     NaN  Female
L         9   NaN  13000.0      RJ       M
Q        10  30.0  14000.0     NaN  Female
w        11  31.0      NaN     NaN       F
E        12  32.0  16000.0     NaN       M
R        13  33.0  17000.0      KA    Male
NaN      14  34.0      NaN     NaN  Female
Y        15  35.0  19000.0     NaN       M
U        16  36.0  20000.0     NaN    Male
i        17  37.0  21000.0     NaN  Female
O        18  38.0  22000.0     NaN    Male
o        18  38.0  22000.0     NaN       M
Y        15  35.0  19000.0     NaN       M

In [47]:
data.drop(columns = ['Address'] , inplace = True)

In [48]:
data

      EmpId   Age   Salary  Gender
Name
A         1  21.0   5000.0       M
S         2  22.0   6000.0       M
D         3  23.0   7000.0       F
F         4  24.0   8000.0       F
G         5  25.0   9000.0    Male
h         6  26.0      NaN    Male
K         7  27.0  11000.0       M
K         8  28.0  12000.0  Female
L         9   NaN  13000.0       M
Q        10  30.0  14000.0  Female
w        11  31.0      NaN       F
E        12  32.0  16000.0       M
R        13  33.0  17000.0    Male
NaN      14  34.0      NaN  Female
Y        15  35.0  19000.0       M
U        16  36.0  20000.0    Male
i        17  37.0  21000.0  Female
O        18  38.0  22000.0    Male
o        18  38.0  22000.0       M
Y        15  35.0  19000.0       M

In [49]:
data['Salary'].fillna(data['Salary'].mean(), inplace=True)

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_18176\2720108632.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Salary'].fillna(data['Salary'].mean(), inplace=True)

In [50]:
data

      EmpId   Age        Salary  Gender
Name
A         1  21.0   5000.000000       M
S         2  22.0   6000.000000       M
D         3  23.0   7000.000000       F
F         4  24.0   8000.000000       F
G         5  25.0   9000.000000    Male
h         6  26.0  14176.470588    Male
K         7  27.0  11000.000000       M
K         8  28.0  12000.000000  Female
L         9   NaN  13000.000000       M
Q        10  30.0  14000.000000  Female
w        11  31.0  14176.470588       F
E        12  32.0  16000.000000       M
R        13  33.0  17000.000000    Male
NaN      14  34.0  14176.470588  Female
Y        15  35.0  19000.000000       M
U        16  36.0  20000.000000    Male
i        17  37.0  21000.000000  Female
O        18  38.0  22000.000000    Male
o        18  38.0  22000.000000       M
Y        15  35.0  19000.000000       M

In [51]:
data = data.reset_index('Name')
data

   Name  EmpId   Age        Salary  Gender
0     A      1  21.0   5000.000000       M
1     S      2  22.0   6000.000000       M
2     D      3  23.0   7000.000000       F
3     F      4  24.0   8000.000000       F
4     G      5  25.0   9000.000000    Male
5     h      6  26.0  14176.470588    Male
6     K      7  27.0  11000.000000       M
7     K      8  28.0  12000.000000  Female
8     L      9   NaN  13000.000000       M
9     Q     10  30.0  14000.000000  Female
10    w     11  31.0  14176.470588       F
11    E     12  32.0  16000.000000       M
12    R     13  33.0  17000.000000    Male
13  NaN     14  34.0  14176.470588  Female
14    Y     15  35.0  19000.000000       M
15    U     16  36.0  20000.000000    Male
16    i     17  37.0  21000.000000  Female
17    O     18  38.0  22000.000000    Male
18    o     18  38.0  22000.000000       M
19    Y     15  35.0  19000.000000       M

In [52]:
data = data.dropna()

In [53]:
data

   Name  EmpId   Age        Salary  Gender
0     A      1  21.0   5000.000000       M
1     S      2  22.0   6000.000000       M
2     D      3  23.0   7000.000000       F
3     F      4  24.0   8000.000000       F
4     G      5  25.0   9000.000000    Male
5     h      6  26.0  14176.470588    Male
6     K      7  27.0  11000.000000       M
7     K      8  28.0  12000.000000  Female
9     Q     10  30.0  14000.000000  Female
10    w     11  31.0  14176.470588       F
11    E     12  32.0  16000.000000       M
12    R     13  33.0  17000.000000    Male
14    Y     15  35.0  19000.000000       M
15    U     16  36.0  20000.000000    Male
16    i     17  37.0  21000.000000  Female
17    O     18  38.0  22000.000000    Male
18    o     18  38.0  22000.000000       M
19    Y     15  35.0  19000.000000       M

In [54]:
data[data.duplicated()]

   Name  EmpId   Age   Salary Gender
19    Y     15  35.0  19000.0      M

In [55]:
data.drop_duplicates(inplace = True) 
data

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_18176\1815597345.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.drop_duplicates(inplace = True)

   Name  EmpId   Age        Salary  Gender
0     A      1  21.0   5000.000000       M
1     S      2  22.0   6000.000000       M
2     D      3  23.0   7000.000000       F
3     F      4  24.0   8000.000000       F
4     G      5  25.0   9000.000000    Male
5     h      6  26.0  14176.470588    Male
6     K      7  27.0  11000.000000       M
7     K      8  28.0  12000.000000  Female
9     Q     10  30.0  14000.000000  Female
10    w     11  31.0  14176.470588       F
11    E     12  32.0  16000.000000       M
12    R     13  33.0  17000.000000    Male
14    Y     15  35.0  19000.000000       M
15    U     16  36.0  20000.000000    Male
16    i     17  37.0  21000.000000  Female
17    O     18  38.0  22000.000000    Male
18    o     18  38.0  22000.000000       M

In [56]:
data['Age']=data['Age'].astype(int)

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_18176\1568915698.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Age']=data['Age'].astype(int)

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17 entries, 0 to 18
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    17 non-null     object
 1   EmpId   17 non-null     int64
 2   Age     17 non-null     int64
 3   Salary  17 non-null     float64
 4   Gender  17 non-null     object
dtypes: float64(1), int64(2), object(2)
memory usage: 816.0+ bytes

In [58]:
data['Name'] = data['Name'].str.upper()

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_18176\501790320.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Name'] = data['Name'].str.upper()

In [59]:
data

   Name  EmpId  Age        Salary  Gender
0     A      1   21   5000.000000       M
1     S      2   22   6000.000000       M
2     D      3   23   7000.000000       F
3     F      4   24   8000.000000       F
4     G      5   25   9000.000000    Male
5     H      6   26  14176.470588    Male
6     K      7   27  11000.000000       M
7     K      8   28  12000.000000  Female
9     Q     10   30  14000.000000  Female
10    W     11   31  14176.470588       F
11    E     12   32  16000.000000       M
12    R     13   33  17000.000000    Male
14    Y     15   35  19000.000000       M
15    U     16   36  20000.000000    Male
16    I     17   37  21000.000000  Female
17    O     18   38  22000.000000    Male
18    O     18   38  22000.000000       M

In [61]:
data['Gender'] = data['Gender'].replace({'Male':'M','Female':'F'})
data

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_18176\712276219.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Gender'] = data['Gender'].replace({'Male':'M','Female':'F'})

   Name  EmpId  Age        Salary Gender
0     A      1   21   5000.000000      M
1     S      2   22   6000.000000      M
2     D      3   23   7000.000000      F
3     F      4   24   8000.000000      F
4     G      5   25   9000.000000      M
5     H      6   26  14176.470588      M
6     K      7   27  11000.000000      M
7     K      8   28  12000.000000      F
9     Q     10   30  14000.000000      F
10    W     11   31  14176.470588      F
11    E     12   32  16000.000000      M
12    R     13   33  17000.000000      M
14    Y     15   35  19000.000000      M
15    U     16   36  20000.000000      M
16    I     17   37  21000.000000      F
17    O     18   38  22000.000000      M
18    O     18   38  22000.000000      M

In [63]:
data = data.set_index('Name')
data

      EmpId  Age        Salary Gender
Name
A         1   21   5000.000000      M
S         2   22   6000.000000      M
D         3   23   7000.000000      F
F         4   24   8000.000000      F
G         5   25   9000.000000      M
H         6   26  14176.470588      M
K         7   27  11000.000000      M
K         8   28  12000.000000      F
Q        10   30  14000.000000      F
W        11   31  14176.470588      F
E        12   32  16000.000000      M
R        13   33  17000.000000      M
Y        15   35  19000.000000      M
U        16   36  20000.000000      M
I        17   37  21000.000000      F
O        18   38  22000.000000      M
O        18   38  22000.000000      M